'''Имена переменных из нескольких слов
Имена переменных, состоящие из нескольких слов, могут быть трудными для чтения.

Существует несколько техник, которые вы можете использовать, чтобы сделать их более читаемыми'''

# Каждое слово, кроме первого, начинается с заглавной буквы:
мояПеременнаяИмя = "Camel Case"

# Каждое слово начинается с заглавной буквы:
МояПеременнаяИмя = "Pascal Case"

# Каждое слово разделено символом подчеркивания:
моя_переменная_имя = "Snake Case"

print(моя_переменная_имя , ',' , МояПеременнаяИмя ,'и' , мояПеременнаяИмя)
