'''В программировании тип данных - это важное понятие.

Переменные могут хранить данные разных типов, и разные типы могут выполнять разные действия.

Python имеет следующие встроенные типы данных по умолчанию, в этих категориях:

Текстовый тип:	str
Числовые типы:	int, float, complex
Последовательные типы:	list, tuple, range
Тип отображения:	dict
Типы множеств:	set, frozenset
Булевый тип:	bool
Бинарные типы:	bytes, bytearray, memoryview'''

# Получение типа данных
x = 5
print(type(x)) #= <class 'int'>
